import { Box } from "@mui/material"
import "./coursepage.css"
import Subsicription from "./Subsicription"
import { useEffect } from "react"
import { useParams } from "react-router-dom"
const CoursePage = () => {
    useEffect(() => {
        window.scrollTo(0, 0)
    }, [])
    const { courseName } = useParams()
    return (
        <Box
            className="coursepage"
        >
            <Box
                className="course-header"
                textAlign={"center"}
            >
                <p className="course-heading">
                    الكورس رقم ١ في العالم لتحدث {courseName} بطلاقة
                </p>
                <p>
                    تحدث {courseName} بطلاقة أو إسترد نقودك فوراً
                </p>
                <p>
                    الدورة دي بلا شك هي أقوى دورة لتحدث اللغة {courseName} بطلاقة على كوكب الأرض، أوعدك إنك بمشاهدة فيديوهات هذه الدورة فقط ستتحدث {courseName} بطلاقة بدون حفظ كلمات أو تعلم قواعد أو مذاكرة، فقط عن طريق مشاهدة الفيديوهات، وستصل لمستوى يتعجب منه كل من يعرفك وستتعجب أنت نفسك منه.
                </p>

            </Box>
            <Box
                marginTop={"50px"}
                className="course-body"
            >
                <p className="course-heading">
                    ليه ده أفضل كورس في العالم لتعلم اللغة {courseName}؟
                </p>
                <ol>
                    <li>
                        لن تحتاج للمذاكرة أو حفظ الكلمات ولا تعلم القواعد، لأنك ستكتسب اللغة بالممارسة كأهلها تماماً، وكما إكتسبت لغتك الأم في الصغر ✍️ 📕 ❌
                    </li>
                    <li>
                        لن تحتاج لمعلم معك لأنك ستفهم كل شيء؛ لأن الدروس معدة خصيصاً لتكون دراسة ذاتية لا تحتاج معها لمعلم فقط ستشاهد الدروس وستدخل اللغة لعقلك تلقائياً مثل السحر 🧙
                    </li>
                    <li>
                        لن تتأثر بمشكلة النسيان لأنه لا يوجد حفظ في هذه الدورة ولن تحتاج لمراجعة شيء لأني قمت بذلك بدلاً عنك ستجد الدروس معدة بطريقة معينه بها مراجعة وبها كل شيء 🎦
                    </li>
                    <li>
                        لو تمل بسرعة فالدروس ممتعة و صغيرة جداً مدتها دقيقه ل ٣ دقائق كحد أقصى ⏰ فيمكنك مشاهدتها في أي وقت وفي أي مكان في البيت 🏡  في الجيم 🤸  في الشارع في النادي في مكان العمل ...إلخ ولن تحتاج إلى ورقه أو قلم 📑 🖊️
                    </li>
                    <li>
                        الدروس ستبدأ معك من تحت الصفر حتى لو لا تعرف أي شيء عن اللغة لأن هذا المستوى معد خصيصاً للمستوى صفر ثم يتدرج معك في المستوى بشكل تدريجي جداً 🛣️
                    </li>
                    <li>

                        الدراسة في هذا الكورس لا يوجد لها أكثر من إحتمال واحد إما أن تتكلم {courseName} بطلاقة أو تتكلم {courseName} بطلاقة لا يوجد أي إحتمالات أخرى 🤩🔥
                    </li>
                </ol>
            </Box>
            <Box>
                <p className="course-heading">
                    ما الذي ستتعلمه في هذا الدورة ؟
                </p>
                <ol>
                    <li>
                        ستتعلم المحادثة {courseName} من أول محاضرة عن طريق الممارسة.
                    </li>
                    <li>
                        ستتعلم التكلم بلهجة واضحة ومفهومة وهتفهم كل اللهجات المختلفة، وستدرس علم الصوتيات وفهم جميع الرموز الخاصه بالقواميس لتعرف كيف تنطق أي كلمة {courseName} لوحدك دون الحاجة لمعلم.
                    </li>
                    <li>
                        ستتعلم كيف تفهم أي فيديو {courseName} أو فيلم سواء اللهجة أمريكية أو غير ذلك.
                    </li>
                    <li>
                        ستتعلم القراءة بشكل مبسط جداً وسهل.
                    </li>
                    <li>
                        الدروس ستبدأ معك من تحت الصفر حتى لو لا تعرف أي شيء عن اللغة لأن هذا المستوى معد خصيصاً للمستوى صفر ثم يتدرج معك في المستوى بشكل تدريجي جداً 🛣️
                    </li>
                    <li>
                        مش هتحتاج تدرس أي حاجة بعد الكورس ده لأني هعلمك كل حاجه هتحتاجها.
                    </li>
                </ol>
            </Box>
            <Box
                textAlign={"center"}
                marginBottom={"30px"}
            >
                <p className="course-heading">
                    مدى إحتمالية إني معرفش أتكلم {courseName} بعد مشاهدة الدورة كم فى المية؟
                </p>
                <p>
                    صفر فى المية (احتمال مستحيل)😎 لأن الفيديوهات ممارسة مش مذاكرة ولا تعليم.
                </p>
            </Box>
            <Box>
                <p className="course-heading">
                    عدد المستويات في الكورس؟
                </p>
                <p>
                    الكورس بيبدأ من تحت الصفر بمعدل درس (فيديو) يومي ويتدرج معاك حتى مستوى الطلاقة بشكل تدريجي جدااا فلن تجد صعوبة أبداً.
                </p>
            </Box>
            <Box
                marginTop={"40px"}
            >
                <p className="course-heading" style={{ marginBottom: "20px" }}>
                    السعر
                </p>
                <Box
                    display={"flex"}
                    justifyContent={"center"}
                    flexWrap={"wrap"}
                    gap={"50px"}
                >
                    <Subsicription type="شهري" />
                    <Subsicription type="سنوي">
                        <div className="subscribe-body year">
                            <p style={{ color: "var(--secondary)" }}>خاص بالاشتراك السنوي</p>
                            <div>
                                <p>مجموعة خاصة لكل المشتركين لمناقشة الدروس سوياً ولطرح الأسئلة والإستفسارت</p>
                                <p>شهادة حضور بعد انتهاء كل مستوى</p>
                                <p>تقييم شهري لنطقك في اللغة من قبل مستر عبدالله</p>
                            </div>
                        </div>
                    </Subsicription>
                </Box>
            </Box>
        </Box>
    )
}

export default CoursePage
